# RbsFpSprinklerKFactorParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsFpSprinklerKFactorParam Property
ParameterTypeId Class See Also
---
"K-Factor"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsFpSprinklerKFactorParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsFpSprinklerKFactorParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsFpSprinklerKFactorParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace